C2LP-Assistant/C2LP.Assistant.TMSConsole/bin/Debug/AccessRecord/Node_20170710150613_HD2524847.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.webservice.vtradex.com" > <soapenv:Header/><soapenv:Body><ser:tmsShipmentInTransitXml><?xml version="1.0"?>
<XML xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <MESSAGEHEAD>
    <SENDER>NBJC01160122</SENDER>
    <FILETYPE>XML</FILETYPE>
    <CONTENTTYPE>CarrierTrackRecord</CONTENTTYPE>
    <SENDTIME>2017-07-10 15:06:12</SENDTIME>
    <FILENAME>20170710150612</FILENAME>
    <FILEFUNCTION>ADD</FILEFUNCTION>
  </MESSAGEHEAD>
  <MESSAGEDETAIL><![CDATA[<?xml version="1.0"?>
<XML xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <CONTENTLIST>
    <CONTENT>
      <HEADER />
      <DETAILLIST>
        <DETAIL>
          <ECNO>161130108</ECNO>
          <CECNO>991000000018</CECNO>
          <LEGNO>HD2524847</LEGNO>
          <TRACKTIME>2017-03-02 03:57:12</TRACKTIME>
          <TRACKPERSON>余国庆</TRACKPERSON>
          <TRACKINFO>【浙BP79C2】 配送员【余国庆】已出发 准备运往【东阳】</TRACKINFO>
          <TRACKTYPE>17</TRACKTYPE>
        </DETAIL>
      </DETAILLIST>
    </CONTENT>
  </CONTENTLIST>
</XML>]]></MESSAGEDETAIL>
</XML></ser:tmsShipmentInTransitXml></soapenv:Body></soapenv:Envelope>

-------------------------------------------------------------------------

<?xml version="1.0" encoding="UTF-8"?><XML><MSGCODE>1</MSGCODE><MSGCONTENT></MSGCONTENT><MSGNAME>20170710150612</MSGNAME></XML>